
#Область ПрограммныйИнтерфейс

// Выполняет дополнительную настройку элементов формы.
//
// Параметры:
//  Форма - Произвольный - Форма, для которой выполняется настройка.
//
Процедура ДополнитьФорму (Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);	
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма) 
	
	РодительЭлемента = Форма.Элементы.ГруппаШапкаПраво;
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), РодительЭлемента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
	ОтборКонтактногоЛицаПоКонтрагенту(Форма, ПолеВвода); 
	
КонецПроцедуры 

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма) 
	
	РодительЭлемента = Форма.Элементы.СуммаДокумента;
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,РодительЭлемента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
	ОтборКонтактногоЛицаПоКонтрагенту(Форма, ПолеВвода);
	
КонецПроцедуры 

Процедура ОтборКонтактногоЛицаПоКонтрагенту(Форма, ПолеВвода)
	
	ПолеКонтрагента = Форма.Элементы.Найти("Контрагент");
	Если ПолеКонтрагента <> Неопределено Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", ПолеКонтрагента.ПутьКДанным);
		
		МассивСвязей = Новый Массив;
		МассивСвязей.Добавить(НоваяСвязь);
		
		ПолеВвода.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
		
		ПолеКонтрагента.УстановитьДействие("ПриИзменении", "Подключаемый_КонтрагентПриИзменении");
		ПолеКонтрагента.УстановитьДействие("Очистка", "Подключаемый_КонтрагентПриОчистке");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
