
#Область ПрограммныйИнтерфейс

// Выполняет дополнительную настройку элементов формы.
//
// Параметры:
//  Форма - Произвольный - Форма, для которой выполняется настройка.
//
Процедура ДополнитьФорму (Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Документ.ЗаказПокупателя.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ПоступлениеТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаОтПокупателя.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);
		
	ИначеЕсли ИмяФормы = "Документ.ОплатаПоставщику.Форма.ФормаДокумента" Тогда
		ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма);	
	КонецЕсли;	
	
КонецПроцедуры

// Добавляет элемент СогласованнаяСкидка на форму документа.
// 
// Параметры:
//  Форма - ФормаКлиентскогоПриложения - Форма, на которую добавляются элементы.
//
Процедура ДобавитьСкидкуНаФормуЗаказа(Форма) Экспорт
	
	ЭлементыФормы = Форма.Элементы;
	
	РодительЭлемента = ЭлементыФормы.Найти("ГруппаШапкаЛево");
	
	ИмяГруппыСкидки = "ГруппаСогласованнаяСкидка";
	
	Если ЭлементыФормы.Найти(ИмяГруппыСкидки) = Неопределено Тогда
		ГруппаСкидки = ЭлементыФормы.Добавить(ИмяГруппыСкидки, Тип("ГруппаФормы"), РодительЭлемента);
		ГруппаСкидки.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		ГруппаСкидки.ОтображатьЗаголовок = Ложь;
		ГруппаСкидки.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
		ЭлементыФормы.Переместить(ГруппаСкидки, РодительЭлемента);
	КонецЕсли;	
	
	КонтейнерДляЭлементов = ЭлементыФормы[ИмяГруппыСкидки];

	Если ЭлементыФормы.Найти("ДЗ_СогласованнаяСкидка") = Неопределено Тогда
		ПолеСкидки = ЭлементыФормы.Добавить("ДЗ_СогласованнаяСкидка", Тип("ПолеФормы"), КонтейнерДляЭлементов);
		ПолеСкидки.Вид = ВидПоляФормы.ПолеВвода;
		ПолеСкидки.ПутьКДанным = "Объект.ДЗ_СогласованнаяСкидка";
		ПолеСкидки.Заголовок = "Согласованная скидка";
		ПолеСкидки.МинимальноеЗначение = 0;
		ПолеСкидки.МаксимальноеЗначение = 100;		
		ПолеСкидки.УстановитьДействие("ПриИзменении", "Подключаемый_СогласованнаяСкидкаПриИзменении");
	КонецЕсли;

	ИмяКоманды = "КомандаПересчитатьСкидку";
	Если Форма.Команды.Найти(ИмяКоманды) = Неопределено Тогда
		КомандаФормы = Форма.Команды.Добавить(ИмяКоманды);
		КомандаФормы.Заголовок = "Пересчитать таблицу";
		КомандаФормы.Действие  = "Подключаемый_ВыполнитьПересчетСкидки";
	КонецЕсли; 
	
	Если ЭлементыФормы.Найти("КнопкаПересчитатьСкидку") = Неопределено Тогда
		КнопкаСкидки = ЭлементыФормы.Добавить("КнопкаПересчитатьСкидку", Тип("КнопкаФормы"), КонтейнерДляЭлементов);
		КнопкаСкидки.ИмяКоманды = ИмяКоманды;
		КнопкаСкидки.Отображение = ОтображениеКнопки.КартинкаИТекст;
		КнопкаСкидки.Картинка = БиблиотекаКартинок.Обновить; 
	КонецЕсли; 	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

Процедура ДобавитьПолеКонтактноеЛицоВГруппуШапкаПраво(Форма) 
	
	РодительЭлемента = Форма.Элементы.ГруппаШапкаПраво;
	ПолеВвода = Форма.Элементы.Добавить("КонтактноеЛицо", Тип("ПолеФормы"), РодительЭлемента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
	ОтборКонтактногоЛицаПоКонтрагенту(Форма, ПолеВвода); 
	
КонецПроцедуры 

Процедура ВставитьПолеКонтактноеЛицоНаФормуПередСуммаДокумента(Форма) 
	
	РодительЭлемента = Форма.Элементы.СуммаДокумента;
	ПолеВвода = Форма.Элементы.Вставить("КонтактноеЛицо", Тип("ПолеФормы"), ,РодительЭлемента);
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ДЗ_КонтактноеЛицо";
	
	ОтборКонтактногоЛицаПоКонтрагенту(Форма, ПолеВвода);
	
КонецПроцедуры 

Процедура ОтборКонтактногоЛицаПоКонтрагенту(Форма, ПолеВвода)
	
	ПолеКонтрагента = Форма.Элементы.Найти("Контрагент");
	Если ПолеКонтрагента <> Неопределено Тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", ПолеКонтрагента.ПутьКДанным);
		
		МассивСвязей = Новый Массив;
		МассивСвязей.Добавить(НоваяСвязь);
		
		ПолеВвода.СвязиПараметровВыбора = Новый ФиксированныйМассив(МассивСвязей);
		
		ПолеКонтрагента.УстановитьДействие("ПриИзменении", "Подключаемый_КонтрагентПриИзменении");
		ПолеКонтрагента.УстановитьДействие("Очистка", "Подключаемый_КонтрагентПриОчистке");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
